:PROPERTIES:
:ID:       DD7D894A-4ADC-4808-B24A-C2143B507FEF
:ROAM_ALIASES: org-mode
:END:
#+title: org

* Basics

** org-directory
:PROPERTIES:
:ID:       141D8A2B-2353-4636-9E02-3C9899EB1174
:END:

#+begin_src emacs-lisp
  (describe-variable 'org-directory)
#+end_src

#+RESULTS:
#+begin_example
org-directory is a variable defined in ‘org.el’.

Its value is "~/memex"
Original value was "~/org"

Directory with Org files.
This is just a default location to look for Org files.  There is no need
at all to put your files into this directory.  It is used in the
following situations:

1. When a capture template specifies a target file that is not an
   absolute path.  The path will then be interpreted relative to
   ‘org-directory’
2. When the value of variable ‘org-agenda-files’ is a single file, any
   relative paths in this file will be taken as relative to
   ‘org-directory’.

  You can customize this variable.

#+end_example

#+begin_src emacs-lisp
  (setq org-directory (getenv "ROAM_CABINET"))
#+end_src

#+RESULTS:
: ~/memex

* Tweaks

** Content Styling

*** [[id:7F81651F-8535-47C3-81CB-642446A3106C][auto-fill-mode]]

#+begin_src emacs-lisp :results output
  (add-hook 'org-mode-hook #'auto-fill-mode)
#+end_src

#+RESULTS:

* Weaving

** org-html-publish-to-html

#+begin_src emacs-lisp
  (describe-function #'org-html-publish-to-html)
#+end_src

#+RESULTS:
#+begin_example
org-html-publish-to-html is an autoloaded byte-code-function in
‘ox-html.el’.

(org-html-publish-to-html PLIST FILENAME PUB-DIR)

Publish an org file to HTML.

FILENAME is the filename of the Org file to be published.  PLIST
is the property list for the given project.  PUB-DIR is the
publishing directory.

Return output file name.

#+end_example

** org-publish

#+begin_src emacs-lisp
  (describe-function #'org-publish)
#+end_src

#+RESULTS:
#+begin_example
org-publish is an autoloaded interactive byte-code-function in
‘ox-publish.el’.

(org-publish PROJECT &optional FORCE ASYNC)

Publish PROJECT.

PROJECT is either a project name, as a string, or a project
alist (see ‘org-publish-project-alist’ variable).

When optional argument FORCE is non-nil, force publishing all
files in PROJECT.  With a non-nil optional argument ASYNC,
publishing will be done asynchronously, in another process.

#+end_example

** org-publish-project-alist

#+begin_src emacs-lisp
  (describe-variable 'org-publish-project-alist)
#+end_src

#+RESULTS:
#+begin_example
org-publish-project-alist is a variable defined in ‘ox-publish.el’.

Its value is nil

Association list to control publishing behavior.

Each element of the alist is a publishing project.  The car of
each element is a string, uniquely identifying the project.  The
cdr of each element is in one of the following forms:

1. A well-formed property list with an even number of elements,
   alternating keys and values, specifying parameters for the
   publishing process.

     (:property value :property value ... )

2. A meta-project definition, specifying of a list of
   sub-projects:

     (:components ("project-1" "project-2" ...))

When the CDR of an element of ‘org-publish-project-alist’ is in
this second form, the elements of the list after ‘:components’
are taken to be components of the project, which group together
files requiring different publishing options.  When you publish
such a project with ‘M-x org-publish’, the components all publish.

When a property is given a value in ‘org-publish-project-alist’,
its setting overrides the value of the corresponding user
variable (if any) during publishing.  However, options set within
a file override everything.

Most properties are optional, but some should always be set:

  ‘:base-directory’

    Directory containing publishing source files.

  ‘:base-extension’

    Extension (without the dot!) of source files.  This can be
    a regular expression.  If not given, "org" will be used as
    default extension.  If it is ‘any’, include all the files,
    even without extension.

  ‘:publishing-directory’

    Directory (possibly remote) where output files will be
    published.

If ‘:recursive’ is non-nil files in sub-directories of
‘:base-directory’ are considered.

The ‘:exclude’ property may be used to prevent certain files from
being published.  Its value may be a string or regexp matching
file names you don’t want to be published.

The ‘:include’ property may be used to include extra files.  Its
value may be a list of filenames to include.  The filenames are
considered relative to the base directory.

When both ‘:include’ and ‘:exclude’ properties are given values,
the exclusion step happens first.

One special property controls which backend function to use for
publishing files in the project.  This can be used to extend the
set of file types publishable by ‘org-publish’, as well as the
set of output formats.

  ‘:publishing-function’

    Function to publish file.  Each backend may define its
    own (i.e. ‘org-latex-publish-to-pdf’,
    ‘org-html-publish-to-html’).  May be a list of functions, in
    which case each function in the list is invoked in turn.

Another property allows you to insert code that prepares
a project for publishing.  For example, you could call GNU Make
on a certain makefile, to ensure published files are built up to
date.

  ‘:preparation-function’

    Function to be called before publishing this project.  This
    may also be a list of functions.  Preparation functions are
    called with the project properties list as their sole
    argument.

  ‘:completion-function’

    Function to be called after publishing this project.  This
    may also be a list of functions.  Completion functions are
    called with the project properties list as their sole
    argument.

Some properties control details of the Org publishing process,
and are equivalent to the corresponding user variables listed in
the right column.  Backend specific properties may also be
included.  See the backend documentation for more information.

  :author                   variable ‘user-full-name’
  :creator                  ‘org-export-creator-string’
  :email                    ‘user-mail-address’
  :exclude-tags             ‘org-export-exclude-tags’
  :headline-levels          ‘org-export-headline-levels’
  :language                 ‘org-export-default-language’
  :preserve-breaks          ‘org-export-preserve-breaks’
  :section-numbers          ‘org-export-with-section-numbers’
  :select-tags              ‘org-export-select-tags’
  :time-stamp-file          ‘org-export-timestamp-file’
  :with-archived-trees      ‘org-export-with-archived-trees’
  :with-author              ‘org-export-with-author’
  :with-creator             ‘org-export-with-creator’
  :with-date                ‘org-export-with-date’
  :with-drawers             ‘org-export-with-drawers’
  :with-email               ‘org-export-with-email’
  :with-emphasize           ‘org-export-with-emphasize’
  :with-entities            ‘org-export-with-entities’
  :with-fixed-width         ‘org-export-with-fixed-width’
  :with-footnotes           ‘org-export-with-footnotes’
  :with-inlinetasks         ‘org-export-with-inlinetasks’
  :with-latex               ‘org-export-with-latex’
  :with-planning            ‘org-export-with-planning’
  :with-priority            ‘org-export-with-priority’
  :with-properties          ‘org-export-with-properties’
  :with-smart-quotes        ‘org-export-with-smart-quotes’
  :with-special-strings     ‘org-export-with-special-strings’
  :with-statistics-cookies’ ‘org-export-with-statistics-cookies’
  :with-sub-superscript     ‘org-export-with-sub-superscripts’
  :with-toc                 ‘org-export-with-toc’
  :with-tables              ‘org-export-with-tables’
  :with-tags                ‘org-export-with-tags’
  :with-tasks               ‘org-export-with-tasks’
  :with-timestamps          ‘org-export-with-timestamps’
  :with-title               ‘org-export-with-title’
  :with-todo-keywords       ‘org-export-with-todo-keywords’

The following properties may be used to control publishing of
a site-map of files or summary page for a given project.

  ‘:auto-sitemap’

    Whether to publish a site-map during
    ‘org-publish-current-project’ or ‘org-publish-all’.

  ‘:sitemap-filename’

    Filename for output of site-map.  Defaults to "sitemap.org".

  ‘:sitemap-title’

    Title of site-map page.  Defaults to name of file.

  ‘:sitemap-style’

    Can be ‘list’ (site-map is just an itemized list of the
    titles of the files involved) or ‘tree’ (the directory
    structure of the source files is reflected in the site-map).
    Defaults to ‘tree’.

  ‘:sitemap-format-entry’

    Plugin function used to format entries in the site-map.  It
    is called with three arguments: the file or directory name
    relative to base directory, the site map style and the
    current project.  It has to return a string.

    Defaults to ‘org-publish-sitemap-default-entry’, which turns
    file names into links and use document titles as
    descriptions.  For specific formatting needs, one can use
    ‘org-publish-find-date’, ‘org-publish-find-title’ and
    ‘org-publish-find-property’, to retrieve additional
    information about published documents.

  ‘:sitemap-function’

    Plugin function to use for generation of site-map.  It is
    called with two arguments: the title of the site-map, as
    a string, and a representation of the files involved in the
    project, as returned by ‘org-list-to-lisp’.  The latter can
    further be transformed using ‘org-list-to-generic’,
    ‘org-list-to-subtree’ and alike.  It has to return a string.

    Defaults to ‘org-publish-sitemap-default’, which generates
    a plain list of links to all files in the project.

If you create a site-map file, adjust the sorting like this:

  ‘:sitemap-sort-folders’

    Where folders should appear in the site-map.  Set this to
    ‘first’ or ‘last’ to display folders first or last,
    respectively.  When set to ‘ignore’ (default), folders are
    ignored altogether.  Any other value will mix files and
    folders.  This variable has no effect when site-map style is
    ‘tree’.

  ‘:sitemap-sort-files’

    The site map is normally sorted alphabetically.  You can
    change this behavior setting this to ‘anti-chronologically’,
    ‘chronologically’, or nil.

  ‘:sitemap-ignore-case’

    Should sorting be case-sensitive?  Default nil.

The following property control the creation of a concept index.

  ‘:makeindex’

    Create a concept index.  The file containing the index has to
    be called "theindex.org".  If it doesn’t exist in the
    project, it will be generated.  Contents of the index are
    stored in the file "theindex.inc", which can be included in
    "theindex.org".

Other properties affecting publication.

  ‘:body-only’

    Set this to t to publish only the body of the documents.

  You can customize this variable.

#+end_example

* Agenda
:PROPERTIES:
:ID:       5A8DAB59-E431-4E8E-9E7C-6A7CC79C1D3C
:ROAM_ALIASES: org-agenda
:END:

** Configuration
I tweak the agenda to match my preferred flow.

*** org-agenda-files

#+begin_src emacs-lisp
  (describe-variable 'org-agenda-files)
#+end_src

#+RESULTS:
#+begin_example
org-agenda-files is a variable defined in ‘org.el’.

Its value is ("/Users/mwhipple/memex")
Original value was nil

The files to be used for agenda display.

If an entry is a directory, all files in that directory that are matched
by ‘org-agenda-file-regexp’ will be part of the file list.

If the value of the variable is not a list but a single file name, then
the list of agenda files is actually stored and maintained in that file,
one agenda file per line.  In this file paths can be given relative to
‘org-directory’.  Tilde expansion and environment variable substitution
are also made.

Entries may be added to this list with ‘M-x org-agenda-file-to-front’
and removed with ‘M-x org-remove-file’.

  You can customize this variable.

#+end_example

Let's just set this to [[id:141D8A2B-2353-4636-9E02-3C9899EB1174][org-directory]].

#+begin_src emacs-lisp :results output
  (setq org-agenda-files (list (file-truename org-directory)))
#+end_src

#+RESULTS:

*** org-agenda-span

#+begin_src emacs-lisp
  (describe-variable 'org-agenda-span)
#+end_src

#+RESULTS:
#+begin_example
org-agenda-span is a variable defined in ‘org-agenda.el’.

Its value is ‘week’

Number of days to include in overview display.
Can be day, week, month, year, or any number of days.
Custom commands can set this variable in the options section.

  You can customize this variable.

#+end_example

#+begin_src emacs-lisp
  (setq org-agenda-span 'day)
#+end_src

#+RESULTS:
: day

*** org-agenda-todo-ignore-scheduled

#+begin_src emacs-lisp
  (describe-variable 'org-agenda-todo-ignore-scheduled)
#+end_src

#+RESULTS:
#+begin_example
org-agenda-todo-ignore-scheduled is a variable defined in ‘org-agenda.el’.

Its value is nil

Non-nil means, ignore some scheduled TODO items when making TODO list.
This applies when creating the global todo list.
Valid values are:

past     Don’t show entries scheduled today or in the past.

future   Don’t show entries scheduled in the future.
         The idea behind this is that by scheduling it, you don’t want to
         think about it until the scheduled date.

all      Don’t show any scheduled entries in the global todo list.
         The idea behind this is that by scheduling it, you have already
         "taken care" of this item.

t        Same as ‘all’, for backward compatibility.

This variable can also have an integer as a value.  See
‘org-agenda-todo-ignore-timestamp’ for more details.

See also ‘org-agenda-todo-ignore-with-date’.
See also the variable ‘org-agenda-tags-todo-honor-ignore-options’ if you want
to make his option also apply to the tags-todo list.

  You can customize this variable.

#+end_example

#+begin_src emacs-lisp
  (setq org-agenda-todo-ignore-scheduled t)
#+end_src

#+RESULTS:
: t

*** org-deadline-past-days

#+begin_src emacs-lisp
  (describe-variable 'org-deadline-past-days)
#+end_src

#+RESULTS:
#+begin_example
org-deadline-past-days is a variable defined in ‘org-agenda.el’.

Its value is 10000

Number of days to warn about missed deadlines.
When an item has deadline on a date, it shows up in the agenda on
this day and will appear as a reminder until it is marked DONE or
for the number of days given here.

  This variable is safe as a file local variable if its value
  satisfies the predicate ‘integerp’.
  This variable was introduced, or its default value was changed, in
  version 26.1 of Emacs.
  You can customize this variable.

#+end_example

*** org-scheduled-past-days

To accomodate some personal quirky use of org agenda, I want items to
show up that may be fairly ancient.

#+begin_src emacs-lisp
  (describe-variable 'org-scheduled-past-days)
#+end_src

#+RESULTS:
#+begin_example
org-scheduled-past-days is a variable defined in ‘org-agenda.el’.

Its value is 10000

Number of days to continue listing scheduled items not marked DONE.
When an item is scheduled on a date, it shows up in the agenda on
this day and will be listed until it is marked done or for the
number of days given here.

  This variable is safe as a file local variable if its value
  satisfies the predicate ‘integerp’.
  You can customize this variable.

#+end_example

#+begin_src emacs-lisp
  (setq org-scheduled-past-days 999999)
#+end_src

#+RESULTS:
: 999999


*** Diplay tweaks

**** [[id:597907CE-BFD2-4638-A46C-AD30F240B357][hl-line-mode]]

#+begin_src emacs-lisp :results output
  (add-hook 'org-agenda-mode-hook #'hl-line-mode)
#+end_src

#+RESULTS:

* API
** org-element-context

#+begin_src emacs-lisp
  (describe-function #'org-element-context)
#+end_src

#+RESULTS:
#+begin_example
org-element-context is an autoloaded byte-code-function in
‘org-element.el’.

(org-element-context &optional ELEMENT)

Return smallest element or object around point.

Return value is a list like (TYPE PROPS) where TYPE is the type
of the element or object and PROPS a plist of properties
associated to it.

Possible types are defined in ‘org-element-all-elements’ and
‘org-element-all-objects’.  Properties depend on element or
object type, but always include ‘:begin’, ‘:end’, ‘:parent’ and
‘:post-blank’.

As a special case, if point is right after an object and not at
the beginning of any other object, return that object.

Optional argument ELEMENT, when non-nil, is the closest element
containing point, as returned by ‘org-element-at-point’.
Providing it allows for quicker computation.

This function may modify match data.

#+end_example

** org-element-type

#+begin_src emacs-lisp
  (describe-function #'org-element-type)
#+end_src

#+RESULTS:
#+begin_example
org-element-type is a byte-code-function in ‘org-element-ast.el’.

(org-element-type NODE &optional ANONYMOUS)

Return type of NODE.

The function returns the type of the node provided.
It can also return the following special value:
  ‘plain-text’       for a string
  nil                in any other case.

When optional argument ANONYMOUS is non-nil, return symbol ‘anonymous’
when NODE is an anonymous node.

  This function does not change global state, including the match data.

#+end_example
